# -*- mode: ruby -*-
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-versions"
tap "railwaycat/emacsmacport"

brew "railwaycat/emacsmacport/emacs-mac", args: ["with-modules"]

brew "git"
brew "ripgrep"
brew "coreutils"
brew "fd"
brew "myrepos"
brew "graphviz"
brew "jq"
brew "mr"
brew "rbenv"
brew "haskell-stack"
# used to compile vterm-mode
brew "cmake"
brew "pyenv"
brew "bitwarden-cli"
brew "wget"

# casks
cask "hammerspoon"
cask "firefox-developer-edition"
cask "dropbox"
cask "slack"
cask "spotify"
